import React from 'react';

const AboutMeSection: React.FC = () => (
  <section>
    <h2 className="text-2xl font-bold mb-4">ABOUT ME</h2>
    <p className="mb-4">
      저는 개발과 무관한 분야에서 경력을 시작했지만, 한국통계정보원에서의 경험을 통해 개발의 중요성을 깨닫고 개발자의
      길을 걷게 되었습니다. 통계 DB 시스템에서 데이터를 관리하면서 코드를 통해 문제를 해결하는 모습을 지켜보며, 개발에
      대한 관심이 생겨 KDT 학원에서 다양한 언어와 기술을 학습하게 되었습니다. 이 경험은 개발자로서 성장하는 데 중요한
      계기가 되었습니다.
    </p>
    <p className="mb-4">
      팀 프로젝트를 통해 HTML, CSS, JavaScript, Node.js 등 다양한 기술을 활용하며 웹 애플리케이션 개발에 대한 이해를
      넓혔습니다. 1차 협업에서는 컴포넌트와 모듈화를 사용하지 않고 정적 파일로 작업을 진행하면서, 파일 간 연결 문제와
      빈번한 병합 이슈를 겪었습니다. 이를 개선하기 위해 Express의 데코레이터를 사용해 코드 리팩토링을 진행하였고, 코드
      해석이 쉬워지면서 서버 작업의 효율이 크게 향상되었습니다.
    </p>
    <p className="mb-4">
      2차 프로젝트에서는 1차에서 부족했던 아키텍처 설계를 체계화하고, 기능 우선순위를 정해 작업 흐름을 개선했습니다.
      Google Sheets로 작업을 시각화하여 동료들이 우선순위에 맞춰 작업을 이어갈 수 있게 했고, 불필요한 회의를 줄이면서도
      매주 금요일 코드 리뷰를 통해 프로젝트의 방향성을 유지했습니다. 이러한 노력은 작업 속도와 효율성을 크게 높이는 데
      기여했습니다.
    </p>
    <p>
      개인 프로젝트와 팀 프로젝트를 병행하며 Git과 GitHub를 활용한 협업 경험을 통해 소통과 문제 해결 능력을
      향상시켰습니다. Notion을 활용해 문제 해결 방법을 기록하고 공유함으로써 팀의 효율성을 높였으며, 앞으로도 끊임없이
      학습하고 적용하여 더 나은 개발자로 성장하고자 합니다.
    </p>
  </section>
);

export default AboutMeSection;
