// src/data/careerData.ts
export const careers = [
  {
    period: '2023.04 ~ 2024.01',
    company: '재단법인한국통계정보원',
    role: '사원 (계약직) | 자료관리부',
    duration: '10개월',
    description:
      'KOSIS 파일 서비스의 Excel 및 PDF 형식의 파일을 최신 상태로 유지하고 관리하는 업무를 담당했습니다. 이를 위해 데이터의 정확성을 검토하고, 필요한 업데이트를 신속하게 반영하여 KOSIS 사용자들이 항상 최신 정보를 사용할 수 있도록 지원했습니다. 또한, 대량의 데이터를 효율적으로 처리하기 위해 파일 관리 프로세스를 개선하고, 사용자 피드백을 반영하여 파일 서비스를 최적화하는 역할을 수행했습니다.',
  },
  {
    period: '2022.05 ~ 2023.01',
    company: '(주)한결글로벌로지스',
    role: '사원 | 대전지점',
    duration: '9개월',
    description:
      '일일 근무자들의 일급 계산 및 급여 지급 업무를 담당하였으며, 산업 안전 및 보건 관리자로서 근로자들의 안전을 위한 다양한 교육 및 관리 활동을 진행했습니다. 또한, 매일 보고서를 작성하고 제출하여 회사의 안전 관리 현황을 체계적으로 관리하였으며, 고객 응대 및 클레임 처리 등을 통해 CS 관리 업무도 함께 수행하였습니다. 이 외에도 사무실 운영 전반에 걸친 행정적 지원 업무를 통해 회사의 원활한 운영을 도왔습니다.',
  },
  {
    period: '2021.07 ~ 2021.12',
    company: '(주)지오매틱스',
    role: '팀원 (계약직) | GIS 사업체 DB관리부',
    duration: '6개월',
    description:
      '조사원들이 각 구역에서 수집한 사업체 자료를 디지털화하고, 이를 내부 DB 프로그램에 정확히 매칭하는 작업을 수행했습니다. 해당 작업은 국가 통계 데이터의 정확성을 유지하고, 매년 사업체 통계 현황을 제공하는 데 중요한 역할을 합니다. 이 과정에서 스캔된 자료의 품질을 확인하고, 오류를 최소화하기 위한 데이터 검증 절차를 강화하여 통계원이 신뢰할 수 있는 자료를 확보할 수 있도록 지원했습니다.',
  },
  {
    period: '2019.09 ~ 2020.02',
    company: '대전도시공사',
    role: '캐스터 (계약직) | 사파리',
    duration: '6개월',
    description:
      '대전 오월드 내 사파리 구역에서 캐스터 역할을 맡아 방문객들에게 동물에 대한 정보와 사파리 투어를 안내하는 업무를 수행했습니다. 투어 중 안전 수칙을 전달하고, 동물에 대한 흥미로운 사실과 환경 보호의 중요성을 알리며 방문객의 이해를 돕고, 투어의 만족도를 높이는 데 기여했습니다. 또한, 긴급 상황 발생 시 빠른 대처를 위해 사파리 운영팀과 긴밀하게 소통하며 현장을 관리했습니다.',
  },
];
